package main

import "fmt"

//!บวกเมทริกซ์ 2 เมทริกซ์ มิติ m x n จากที่โจทย์ระบุให้
/*
  บรรทัดแรก จำนวนเต็มบวก=>> m , n (1 <= m , n <= 100) แสดงมิติของเมทริกซ์
  บรรทัดที่ 2 ถึงบรรทัดที่ m + 1=>> จำนวนเต็ม n จำนวนในแต่ละบรรทัด แสดงสมาชิกของเมทริกซ์ที่หนึ่ง
  บรรทัดที่ m + 2 ถึงบรรทัดที่ 2*m + 1=>> จำนวนเต็ม n จำนวนในแต่ละบรรทัด แสดงสมาชิกของเมทริกซ์ที่สอง คุณสามารถสมมติได้ว่าสมาชิกของเมทริกซ์แต่ละตัวนั้น มีค่าไม่ต่ำกว่า -2,000,000,000 และไม่เกิน 2,000,000,000
*/

func main() {
	//=>row
	m := 3
	//=>column
	n := 3

	//=>matrix A
	A := [3][3]int{
		{1, 2, 3},
		{3, 2, 1},
		{1, 3, 2},
	}
	//=>matrix B
	B := [3][3]int{
		{1, 1, 1},
		{1, 1, 1},
		{1, 1, 1},
	}
	//=>empty matrix C
	var C [3][3]int

	//=>Plus matrix
	for row := 0; row < m; row++ {
		for column := 0; column < n; column++ {
			C[row][column] = A[row][column] + B[row][column]
		}
	}

	//=>Display successful matrix C
	fmt.Println(C)
}
